1.0*k1*α1 → ok
- l1*lc2*m2*α.2*(2.0*α.1 → ok
                 + 1.0*α.2) → ok
*sin(α2 + β2) +
α..1*(1.0*I2 → ok
      + 1.0*Ia → ok
      + 1.0*l1**2*m2 → ok
      + 2.0*l1*lc2*m2*cos(α2 + β2) → ok
      + 1.0*lc2**2*m2) → ok
+ 1.0*α..2*(I2 →
            + l1*lc2*m2*cos(α2 + β2) → ok
            + lc2**2*m2) → ok

1.0*k2*α2 → ok
+ 1.0*l1*lc2*m2*α.1**2*sin(α2 + β2) → ok
+ 1.0*α..1*(I2 → ok
            + l1*lc2*m2*cos(α2 + β2) → ok
            + lc2**2*m2) → ok
+ 1.0*α..2*(I2 → ok
            + lc2**2*m2) → ok