A função de Lagrange é:
  
0.5*I2*(α1 + α2)**2 → ok 1
+ 0.5*Ia*α1**2 → ok 2
- g*l1*m2*(α1*cos(β1) + sin(β1)) → sin ok
- g*lc1*m1*(α1*cos(β1) + sin(β1)) → sin ok
- g*lc2*m2*((α1 + α2)*cos(β1 + β2) + sin(β1 + β2)) → sin ok
- 0.5*k1*(
α1 + → ok 
(
-g*lc2*m2*cos(β1 + β2) 
- (g*l1*m2 + g*lc1*m1)*cos(β1)
)/k1
)**2

- 0.5*k2*(
  -g*lc2*m2*cos(β1 + β2)/k2 
  + α2 → ok
  )**2 

+ 0.5*m2*(
  l1**2*α1**2 + 2*l1*lc2*α1**2*cos(α2 + β2) 
+ 2*l1*lc2*α1*α2*cos(α2 + β2) 
+ lc2**2*α1**2 
+ 2*lc2**2*α1*α2 
+ lc2**2*α2**2
)

# -------------------------------------------------------------------